## repositories plan
```
module.template-repository.github_repository.default: Refreshing state... [id=template-repository]
module.moj-terraform-scim-github.github_repository.default: Refreshing state... [id=moj-terraform-scim-github]
module.tech-docs-monitor.github_repository.default: Refreshing state... [id=tech-docs-monitor]
module.technical-guidance.github_repository.default: Refreshing state... [id=technical-guidance]
module.operations-engineering.github_repository.default: Refreshing state... [id=operations-engineering]
module.moj-terraform-aws-sso.github_repository.default: Refreshing state... [id=moj-terraform-aws-sso]
module.template-documentation-site.github_repository.default: Refreshing state... [id=template-documentation-site]
module.cloud-platform-maintenance-pages.github_repository.default: Refreshing state... [id=cloud-platform-maintenance-pages]
module.operations-engineering-certificate-renewal.github_repository.default: Refreshing state... [id=operations-engineering-certificate-renewal]
module.terraform-aws-mtasts.github_repository.default: Refreshing state... [id=terraform-aws-mtasts]
module.operations-engineering-reports.github_repository.default: Refreshing state... [id=operations-engineering-reports]
module.terraform-github-repository.github_repository.default: Refreshing state... [id=terraform-github-repository]
module.acronyms.github_repository.default: Refreshing state... [id=acronyms]
module.operations-engineering-join-github.github_repository.default: Refreshing state... [id=operations-engineering-join-github]
module.operations-engineering-documentation-browser-extension.github_repository.default: Refreshing state... [id=operations-engineering-documentation-browser-extension]
module.tech-docs-github-pages-publisher.github_repository.default: Refreshing state... [id=tech-docs-github-pages-publisher]
module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.github-collaborators.github_repository.default: Refreshing state... [id=github-collaborators]
module.operations-engineering-user-guide.github_repository.default: Refreshing state... [id=operations-engineering-user-guide]
module.operations-engineering-devcontainer.github_repository.default: Refreshing state... [id=operations-engineering-devcontainer]
module.operations-engineering-runbooks.github_repository.default: Refreshing state... [id=operations-engineering-runbooks]
module.terraform-template-poc.github_repository.default: Refreshing state... [id=terraform-template-poc]
module.operations-engineering-example.github_repository.default: Refreshing state... [id=operations-engineering-example]
module.github.github_repository.default: Refreshing state... [id=.github]
module.operations-engineering-metadata-poc.github_repository.default: Refreshing state... [id=operations-engineering-metadata-poc]
module.template-repository.github_repository_tag_protection.default: Refreshing state... [id=165191]
module.template-repository.data.github_actions_public_key.default: Reading...
module.template-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDODYkhA84CwPiC]
module.moj-terraform-scim-github.data.github_actions_public_key.default: Reading...
module.moj-terraform-scim-github.github_repository_tag_protection.default: Refreshing state... [id=164897]
module.moj-terraform-scim-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoPJ8s4CwGtf]
module.tech-docs-monitor.github_repository_tag_protection.default: Refreshing state... [id=165188]
module.template-repository.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.tech-docs-monitor.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHQFa_s4CwPiA]
module.tech-docs-monitor.data.github_actions_public_key.default: Reading...
module.moj-terraform-aws-sso.github_repository_tag_protection.default: Refreshing state... [id=164896]
module.moj-terraform-scim-github.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.moj-terraform-aws-sso.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEYOl7c4CwGtj]
module.moj-terraform-aws-sso.data.github_actions_public_key.default: Reading...
module.cloud-platform-maintenance-pages.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEeVbDs4CwGth]
module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Reading...
module.cloud-platform-maintenance-pages.github_repository_tag_protection.default: Refreshing state... [id=164899]
module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Reading...
module.operations-engineering-certificate-renewal.github_branch_protection.default: Refreshing state... [id=BPR_kwDOI-Hjhc4CwPF_]
module.tech-docs-monitor.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering-certificate-renewal.github_repository_tag_protection.default: Refreshing state... [id=165171]
module.terraform-aws-mtasts.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHWUugs4CwPiH]
module.terraform-aws-mtasts.github_repository_tag_protection.default: Refreshing state... [id=165192]
module.terraform-aws-mtasts.data.github_actions_public_key.default: Reading...
module.moj-terraform-aws-sso.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.template-documentation-site.github_repository_tag_protection.default: Refreshing state... [id=165193]
module.template-documentation-site.data.github_actions_public_key.default: Reading...
module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.template-documentation-site.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEQGgTs4CwPiI]
module.operations-engineering-reports.github_repository_tag_protection.default: Refreshing state... [id=165169]
module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering-reports.data.github_actions_public_key.default: Reading...
module.operations-engineering-reports.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEpRCis4CwPF-]
module.terraform-github-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLELUgs4CwkFQ]
module.operations-engineering-documentation-browser-extension.github_repository_tag_protection.default: Refreshing state... [id=165168]
module.operations-engineering-documentation-browser-extension.github_branch_protection.default: Refreshing state... [id=BPR_kwDOK636CM4CwPF8]
module.terraform-aws-mtasts.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Reading...
module.tech-docs-github-pages-publisher.github_repository_tag_protection.default: Refreshing state... [id=165187]
module.template-documentation-site.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Reading...
module.tech-docs-github-pages-publisher.github_branch_protection.default: Refreshing state... [id=BPR_kwDOE7RAx84CwPh_]
module.github-actions.github_repository_tag_protection.default: Refreshing state... [id=164901]
module.operations-engineering-reports.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.github-actions.data.github_actions_public_key.default: Reading...
module.github-actions.github_branch_protection.default: Refreshing state... [id=BPR_kwDODNFKOs4CwGtk]
module.github-collaborators.data.github_actions_public_key.default: Reading...
module.github-collaborators.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoQScc4CwGtd]
module.github-collaborators.github_repository_tag_protection.default: Refreshing state... [id=164898]
module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.operations-engineering-user-guide.github_repository_tag_protection.default: Refreshing state... [id=165176]
module.operations-engineering-user-guide.data.github_actions_public_key.default: Reading...
module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.operations-engineering-user-guide.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKCGhm84CwPGO]
module.technical-guidance.data.github_actions_public_key.default: Reading...
module.technical-guidance.github_branch_protection.default: Refreshing state... [id=BPR_kwDOBeUD0s4CwPiB]
module.github-actions.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.technical-guidance.github_repository_tag_protection.default: Refreshing state... [id=165189]
module.operations-engineering.github_repository_tag_protection.default: Refreshing state... [id=165184]
module.github-collaborators.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.operations-engineering.data.github_actions_public_key.default: Reading...
module.operations-engineering.github_branch_protection.default: Refreshing state... [id=BPR_kwDODVCV0c4CwPYY]
module.operations-engineering-devcontainer.github_repository_tag_protection.default: Refreshing state... [id=164706]
module.operations-engineering-devcontainer.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLCkQts4Cv-3X]
module.operations-engineering-user-guide.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering-devcontainer.data.github_actions_public_key.default: Reading...
module.operations-engineering-join-github.github_repository_tag_protection.default: Refreshing state... [id=165170]
module.technical-guidance.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.operations-engineering-join-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC4ns4CwPGB]
module.operations-engineering-join-github.data.github_actions_public_key.default: Reading...
module.github.data.github_actions_public_key.default: Reading...
module.github.github_repository_tag_protection.default: Refreshing state... [id=164900]
module.operations-engineering.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOFbeyoM4CwGtg]
module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Reading...
module.operations-engineering-metadata-poc.github_repository_tag_protection.default: Refreshing state... [id=165174]
module.operations-engineering-metadata-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC3Jc4CwPGL]
module.operations-engineering-devcontainer.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.acronyms.data.github_actions_public_key.default: Reading...
module.acronyms.github_repository_tag_protection.default: Refreshing state... [id=164902]
module.acronyms.github_branch_protection.default: Refreshing state... [id=BPR_kwDODR2mI84CwGtl]
module.operations-engineering-join-github.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.terraform-template-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOJKjnDs4CwPiD]
module.github.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.terraform-template-poc.github_repository_tag_protection.default: Refreshing state... [id=165190]
module.terraform-template-poc.data.github_actions_public_key.default: Reading...
module.operations-engineering-example.github_repository_tag_protection.default: Refreshing state... [id=165173]
module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.operations-engineering-example.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKnX9OM4CwPGH]
module.operations-engineering-example.data.github_actions_public_key.default: Reading...
module.operations-engineering-runbooks.data.github_actions_public_key.default: Reading...
module.acronyms.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering-runbooks.github_repository_tag_protection.default: Refreshing state... [id=165175]
module.operations-engineering-runbooks.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKK8OCc4CwPGM]
module.terraform-template-poc.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.operations-engineering-example.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.operations-engineering-runbooks.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.terraform-github-repository.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "terraform-github-repository"
    }

  # module.terraform-github-repository.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOLELUgs4CwkFQ" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOLELUgg" -> "terraform-github-repository" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (4 unchanged attributes hidden)
        }

      ~ required_status_checks {
          - contexts = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.terraform-github-repository.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
        id                          = "terraform-github-repository"
        name                        = "terraform-github-repository"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.terraform-github-repository.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "terraform-github-repository"
      + tag_protection_id = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```